Autodesk.Revit.DB.AppearanceAssetElement.SetRenderingAsset(Autodesk.Revit.DB.Visual.Asset)
Sets the rendering asset for the appearance asset element.
asset:
The new rendering asset.   It should be an appearance asset.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
The asset is not an appearance asset.
Since:
2014

Autodesk.Revit.DB.AppearanceAssetElement.Duplicate(System.String)
Duplicates the appearance asset element.
Remarks:
The asset contained by this element will be duplicated as well.   Changes to the duplicated element or its asset do not affect the original element and asset.
name:
Name of the new appearance asset element - this name must be correctly structured for Revit use and not duplicate the name
of another appearance asset in the document.
Returns:
The new AppearanceAssetElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
The given value for name is already in use as an appearance asset name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2018.1

Autodesk.Revit.DB.AppearanceAssetElement.Create(Autodesk.Revit.DB.Document,System.String,Autodesk.Revit.DB.Visual.Asset)
Creates a new AppearanceAssetElement from an existing rendering asset.
document:
The document in which to create the AppearanceAssetElement.
name:
The name of the AppearanceAssetElement.
asset:
The rendering asset of the element.
Returns:
The new AppearanceAssetElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string.
-or-
name cannot include prohibited characters, such as "{, }, [, ], |, ;, less-than sign, greater-than sign, ?, `, ~".
-or-
The given value for name is already in use as an appearance asset name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014

Autodesk.Revit.DB.AppearanceAssetElement.GetAppearanceAssetElementByName(Autodesk.Revit.DB.Document,System.String)
Gets an AppearanceAssetElement by name.
doc:
Document containing the AppearanceAssetElement.
name:
Name of the AppearanceAssetElement.
Returns:
The AppearanceAssetElement with the given name, or null if this element does not exist.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2014